def mystery(st):#כותרת הפונקציה עם פרמטר st
    i=0#ערך ראשוני
    count=0#ערך ראשוני
    while (st[i]!='.'):#הלולאה תמשיך עד שנגיע לסוף המשפט הראשון - הלולאה תרוץ על אורך המחרוזת hello world
        if (st[i] in 'aeiou'):#כאשר הלולאה תרוץ על אורך המשפט שציינתי, היא בודקת אות אות אם האות היא אות ניקוד
            count=count+1#אם האות היא אות ניקוד תחשיב את זה בספירה
        i=i+1#תגדיל את מונה הלולאה כדי שלא נתקע בלולאה אינסופית
    return count #בסוף הרצת הלולאה תחזיר לי את כמות אותיות הניקוד מהמשפט הראשון
#hello world - e,o,o הן אותיות ניקוד ולכן הספירה תחזיר 3

print(mystery('hellow.world'))