"""
סעיף 1 של תרגיל 13
"""
i=11#ערך התחלתי
while (i>0):#הלולאה רצה כאשר i גדול מ0. בכל הרצה של הלולאה i קטן ב1 ולכן הלולאה רצה 11 פעמים
    i-=1#הורדת ערך המונה של הלולאה
    if (i==5):#כאשר ערך המונה הוא 5
        break#תצא מהלולאה , כלומר עכשיו ניתן להסיק שאנחנו יוצאים מהלולאה לפני 11 ההרצות. הלולאה תרוץ מ11 עד שהמונה הוא 5
    print (i)#מכיוון ש הלולאה רצה מ11 עד 5 אבל יוצאת לפני שאנחנו מדפיסים 5 ופקודת ההדפסה נמצאת בלולאה אז יודפס:
#10 9 8 7 6 (מתחילים מ10 מכיוון שכש i=11 ישר ערכו יורד בתחילת הלולאה)
#הערה נוספת היא שמכיוון שאנחנו מורידים את הערך לפני שאנחנו מדפיסים אותו, אם נתחיל מ11 בעצם הערך הראשון שיודפס יהיה 10 והאחרון 0