"""
סעיף 1 של תרגיל 13
"""
i=11#ערך התחלתי
while (i>0):#הלולאה רצה כאשר i גדול מ0. בכל הרצה של הלולאה i קטן ב1 ולכן הלולאה רצה 11 פעמים
    i-=1#הורדת ערך המונה של הלולאה
    if (i==5):#כאשר ערך המונה הוא 5
        continue#אל תמשיך את הלולאה, אך תחזור להתחלה. זה אומר שלא נדפיס את הערך 5 ונח 5זור עם ערך לכותרת הלולאה
    print (i)#מכיוון ש הלולאה רצה מ11 עד 0 ללא הדפסת 5 פקודת ההדפסה נמצאת בלולאה אז יודפס:
#10 9 8 7 6 4 3 2 1 0
#הערה נוספת היא שמכיוון שאנחנו מורידים את הערך לפני שאנחנו מדפיסים אותו, אם נתחיל מ11 בעצם הערך הראשון שיודפס יהיה 10 והאחרון 0